# specify a directory to install
cask_args appdir: '/Applications'

# install brew packages
brew 'asdf'
brew 'bash'
brew 'bat'
brew 'bitwarden-cli'
brew 'coreutils'
brew 'docker' # cli
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'gpg2'
brew 'jq'
brew 'k9s'
brew 'opencode'
brew 'openjdk'
brew 'pinentry-mac'
brew 'sql-formatter'
brew 'starship'
brew 'stow'
brew 'yq'
brew 'zsh'

# install brew cask applications
cask 'bitwarden'
cask 'divvy'
cask 'docker-desktop' # gui
cask 'drawio'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'lm-studio'
cask 'lunar'
cask 'mactex'
cask 'obsidian'
cask 'ollama-app'
cask 'zed'
